In [12]:
import pandas as pd
import numpy as np
from functools import reduce

**Basico** - conferido

In [13]:
dfBasicoAmazonas = pd.read_csv('dataAgrupados/Basico_AM.csv', sep = ';', encoding = 'unicode_escape')

In [14]:
dfBasicoAmazonas = dfBasicoAmazonas[['Cod_setor','V003', 'V005', 'V009', 'V011']]

In [15]:
dfBasicoAmazonas = dfBasicoAmazonas.replace('X', 0, regex= True)

In [16]:
dfBasicoAmazonas.head()

         Cod_setor  V003    V005    V009    V011
0  130002905000001  5,45  563,03  240,11  932,21
1  130002905000002  5,56   558,4  243,57  591,07
2  130002905000003  5,52  655,95  285,81  798,75
3  130002905000004  5,13  460,61  147,79  564,27
4  130002905000006  5,48  538,83  208,37  576,35

In [17]:
dfBasicoAmazonas = dfBasicoAmazonas.replace(',', '.', regex= True)

In [18]:
dfBasicoAmazonas = dfBasicoAmazonas.astype({'V003':'float','V005':'float','V009':'float','V011':'float'})

In [19]:
dfBasicoAmazonas.rename(columns = {'V003':'MediaMoradorDomicilio',
                     'V005':'RendaMediaDomicilio',
                     'V009':'RendaMediaPerCapitaGeral',
                     'V011':'RendaMediaPerCapitaComRendimento'}, inplace = True)

**Domicilio01** - conferido

In [20]:
dfDomicilio01Amazonas = pd.read_csv('dataAgrupados/Domicilio01_AM.csv', sep = ';', encoding = 'unicode_escape')

In [21]:
dfDomicilio01Amazonas = dfDomicilio01Amazonas.replace('X', 0, regex= True)

In [22]:
#dfDomicilio01Amazonas = dfDomicilio01Amazonas.astype(int)

In [23]:
dfDomicilio01Amazonas = dfDomicilio01Amazonas[['Cod_setor',
                                       'V001', 'V003', 'V005', 'V008','V050',
                                       'V050' ,'V051' ,'V052' ,'V053' ,'V054' ,'V055' ,
                                       'V056' ,'V057' ,'V058' ,'V059' ,]]

In [24]:
dfDomicilio01Amazonas.rename(columns = {
'V001':'nAbsDomicilios' , 
'V003': 'nAbsDomiciliosCasa', 
'V005': 'nAbsDomiciliosApto', 
'V008': 'nAbsImoveisAlugados', 
'V050':'nAbs1PessoasDomicilio',
'V051':'nAbs2PessoasDomicilio',
'V052':'nAbs3PessoasDomicilio',
'V053':'nAbs4PessoasDomicilio',
'V054':'nAbs5PessoasDomicilio',
'V055':'nAbs6PessoasDomicilio',
'V056':'nAbs7PessoasDomicilio',
'V057':'nAbs8PessoasDomicilio',
'V058':'nAbs9PessoasDomicilio',
'V059':'nAbs10PessoasDomicilio'}, inplace = True)

In [25]:
dfDomicilio01Amazonas['nAbs5ouMaisPessoasDomicilio'] = dfDomicilio01Amazonas['nAbs5PessoasDomicilio'] +dfDomicilio01Amazonas['nAbs6PessoasDomicilio'] + dfDomicilio01Amazonas['nAbs7PessoasDomicilio'] + dfDomicilio01Amazonas['nAbs8PessoasDomicilio']
+ dfDomicilio01Amazonas['nAbs9PessoasDomicilio'] + dfDomicilio01Amazonas['nAbs10PessoasDomicilio']

0       810
1       521
2       514
3        13
4        59
       ...
5636     06
5637     08
5638    714
5639    613
5640     88
Length: 5641, dtype: object

In [26]:
dfDomicilio01Amazonas.drop(['nAbs5PessoasDomicilio', 'nAbs6PessoasDomicilio', 'nAbs7PessoasDomicilio',
                        'nAbs8PessoasDomicilio', 'nAbs9PessoasDomicilio', 'nAbs10PessoasDomicilio'], axis =1, inplace = True)

**Domicilio02** - conferido

In [27]:
dfDomicilio02Amazonas = pd.read_csv('dataAgrupados/Domicilio02_AM.csv', sep = ';', encoding = 'unicode_escape')

In [28]:
dfDomicilio02Amazonas = dfDomicilio02Amazonas.replace('X', 0, regex= True)

In [29]:
dfDomicilio02Amazonas = dfDomicilio02Amazonas.astype(int)

In [30]:
dfDomicilio02Amazonas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5641 entries, 0 to 5640
Columns: 134 entries, Cod_setor to V132
dtypes: int64(134)
memory usage: 5.8 MB

In [31]:
dfDomicilio02Amazonas = dfDomicilio02Amazonas[['Cod_setor',
                                       'V001', 'V003', 'V005', 'V008']]

In [32]:
dfDomicilio02Amazonas.rename(columns = {
'V001':'nAbsHabitantes' , 
'V003': 'nAbsMoradoresCasa', 
'V005': 'nAbsMoradoresApto', 
'V008': 'nAbsMoradoresImoveisAlugados', 
}, inplace = True)

In [33]:
dfDomicilio02Amazonas.head()

,Cod_setor,nAbsHabitantes,nAbsMoradoresCasa,nAbsMoradoresApto,nAbsMoradoresImoveisAlugados
0,130002905000001,806,796,0,32
1,130002905000002,1098,1090,0,58
2,130002905000003,807,806,0,1
3,130002905000004,118,118,0,0
4,130002905000006,564,564,0,0

**Pessoa13** - conferido

In [34]:
dfPessoa13Amazonas = pd.read_csv('dataAgrupados/Pessoa13_AM.csv', sep = ';', encoding = 'unicode_escape')

In [35]:
dfPessoa13Amazonas = dfPessoa13Amazonas[['Cod_setor', 'V001']]

In [36]:
dfPessoa13Amazonas = dfPessoa13Amazonas.replace('X', 0, regex= True)

In [37]:
dfPessoa13Amazonas.rename(columns= {'V001':'nAbsConjuges'}, inplace = True)

In [38]:
dfPessoa13Amazonas.head()

         Cod_setor  nAbsConjuges
0  130002905000001           806
1  130002905000002          1098
2  130002905000003           807
3  130002905000004           118
4  130002905000006           564

**Pessoa11** - conferido

In [39]:
dfPessoa11Amazonas = pd.read_csv('dataAgrupados/Pessoa11_AM.csv', sep = ';', encoding = 'unicode_escape')

In [40]:
dfPessoa11Amazonas = dfPessoa11Amazonas[['Cod_setor', 'V001']]

In [41]:
dfPessoa11Amazonas = dfPessoa11Amazonas.replace('X', 0, regex= True)

In [42]:
dfPessoa11Amazonas.rename(columns= {'V001':'nAbsHomensResidentes'}, inplace = True)

**Pessoa12** - conferido

In [43]:
dfPessoa12Amazonas = pd.read_csv('dataAgrupados/Pessoa12_AM.csv', sep = ';', encoding = 'unicode_escape')

In [44]:
dfPessoa12Amazonas = dfPessoa12Amazonas.replace('X', 0, regex= True)

In [45]:
dfPessoa12Amazonas = dfPessoa12Amazonas[['Cod_setor', 'V001']]

In [46]:
dfPessoa12Amazonas.head()

         Cod_setor  V001
0  130002905000001   392
1  130002905000002   545
2  130002905000003   395
3  130002905000004    49
4  130002905000006   240

In [47]:
dfPessoa12Amazonas.rename(columns= {'V001':'nAbsMulheresResidentes'}, inplace = True)

In [48]:
dfPessoa12Amazonas.head()

         Cod_setor  nAbsMulheresResidentes
0  130002905000001                     392
1  130002905000002                     545
2  130002905000003                     395
3  130002905000004                      49
4  130002905000006                     240

**DomicilioRenda** - conferido

In [49]:
dfDomicilioRendaAmazonas = pd.read_csv('dataAgrupados/DomicilioRenda_AM.csv', sep = ';', encoding = 'unicode_escape')

In [50]:
dfDomicilioRendaAmazonas = dfDomicilioRendaAmazonas[['Cod_setor',
                                             'V002', 'V003', 'V004']]

In [51]:
dfDomicilioRendaAmazonas = dfDomicilioRendaAmazonas.replace('X', 0, regex= True)

In [52]:
dfDomicilioRendaAmazonas = dfDomicilioRendaAmazonas.astype(int)

In [53]:
dfDomicilioRendaAmazonas.rename(columns = {'V002':'TotalRendNomMensalDomParticulares',
                                       'V003':'TotalRendimentoNomMensalDomParticularesPermanentes',
                                       'V004':'TotalRendimentoNomMensalDomParitulcaresImprovisados'}
                            , inplace = True)

In [54]:
dfDomicilioRendaAmazonas.head()

,Cod_setor,TotalRendNomMensalDomParticulares,TotalRendimentoNomMensalDomParticularesPermanentes,TotalRendimentoNomMensalDomParitulcaresImprovisados
0,130002905000001,134276,134276,0
1,130002905000002,185463,185463,0
2,130002905000003,178919,178919,0
3,130002905000004,12414,12414,0
4,130002905000006,81266,81266,0

**ResponsavelRenda** - conferido

In [55]:
dfResponsavelRendaAmazonas = pd.read_csv('dataAgrupados/ResponsavelRenda_AM.csv', sep = ';', encoding = 'unicode_escape')

In [56]:
dfResponsavelRendaAmazonas = dfResponsavelRendaAmazonas[['Cod_setor', 
                                                 'V001','V002', 'V003',
                                                 'V004','V005', 'V006',
                                                 'V007','V008', 'V009']]

In [57]:
dfResponsavelRendaAmazonas = dfResponsavelRendaAmazonas.replace('X', 0, regex= True)

In [58]:
dfResponsavelRendaAmazonas = dfResponsavelRendaAmazonas.astype(int)

In [59]:
dfResponsavelRendaAmazonas['nAbsPessoasClasseE'] = dfResponsavelRendaAmazonas['V001'] +dfResponsavelRendaAmazonas['V002'] + dfResponsavelRendaAmazonas['V003']

In [60]:
dfResponsavelRendaAmazonas['nAbsPessoasClasseD'] = dfResponsavelRendaAmazonas['V004']

In [61]:
dfResponsavelRendaAmazonas['nAbsPessoasClasseC'] = dfResponsavelRendaAmazonas['V005'] +dfResponsavelRendaAmazonas['V006']

In [62]:
dfResponsavelRendaAmazonas['nAbsPessoasClasseB'] = dfResponsavelRendaAmazonas['V007']

In [63]:
dfResponsavelRendaAmazonas['nAbsPessoasClasseA'] = dfResponsavelRendaAmazonas['V008'] +  dfResponsavelRendaAmazonas['V009']

In [64]:
dfResponsavelRendaAmazonas.drop(['V001', 'V002', 'V003',
                        'V004', 'V005', 'V006', 'V007', 'V008', 'V009'], axis =1, inplace = True)

In [65]:
dfResponsavelRendaAmazonas.head()

,Cod_setor,nAbsPessoasClasseE,nAbsPessoasClasseD,nAbsPessoasClasseC,nAbsPessoasClasseB,nAbsPessoasClasseA
0,130002905000001,60,6,7,2,1
1,130002905000002,131,11,11,1,1
2,130002905000003,90,17,9,0,0
3,130002905000004,18,0,0,0,0
4,130002905000006,78,7,2,0,0

**DATAFRAME TOTAL.**

In [66]:
data_frames = [dfBasicoAmazonas, dfDomicilio01Amazonas, dfDomicilio02Amazonas, dfPessoa13Amazonas, dfPessoa11Amazonas, dfPessoa12Amazonas,
               dfDomicilioRendaAmazonas, dfResponsavelRendaAmazonas]

In [67]:
dfTotalAmazonas = reduce(lambda  left,right: pd.merge(left,right,on=['Cod_setor'],
                                            how='inner'), data_frames)

In [68]:
dfTotalAmazonas.head()

,Cod_setor,MediaMoradorDomicilio,RendaMediaDomicilio,RendaMediaPerCapitaGeral,RendaMediaPerCapitaComRendimento,nAbsDomicilios,nAbsDomiciliosCasa,nAbsDomiciliosApto,nAbsImoveisAlugados,nAbs1PessoasDomicilio,...,nAbsHomensResidentes,nAbsMulheresResidentes,TotalRendNomMensalDomParticulares,TotalRendimentoNomMensalDomParticularesPermanentes,TotalRendimentoNomMensalDomParitulcaresImprovisados,nAbsPessoasClasseE,nAbsPessoasClasseD,nAbsPessoasClasseC,nAbsPessoasClasseB,nAbsPessoasClasseA
0,130002905000001,5.45,563.03,240.11,932.21,149,146,0,6,6,...,414,392,134276,134276,0,60,6,7,2,1
1,130002905000002,5.56,558.40,243.57,591.07,199,196,0,14,6,...,553,545,185463,185463,0,131,11,11,1,1
2,130002905000003,5.52,655.95,285.81,798.75,147,146,0,1,13,...,412,395,178919,178919,0,90,17,9,0,0
3,130002905000004,5.13,460.61,147.79,564.27,23,23,0,0,3,...,69,49,12414,12414,0,18,0,0,0,0
4,130002905000006,5.48,538.83,208.37,576.35,103,103,0,0,5,...,324,240,81266,81266,0,78,7,2,0,0

In [69]:
dfTotalAmazonas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5641 entries, 0 to 5640
Data columns (total 30 columns):
 #   Column                                               Non-Null Count  Dtype
---  ------                                               --------------  -----
 0   Cod_setor                                            5641 non-null   int64
 1   MediaMoradorDomicilio                                5625 non-null   float64
 2   RendaMediaDomicilio                                  5625 non-null   float64
 3   RendaMediaPerCapitaGeral                             5641 non-null   float64
 4   RendaMediaPerCapitaComRendimento                     5566 non-null   float64
 5   nAbsDomicilios                                       5641 non-null   int64
 6   nAbsDomiciliosCasa                                   5641 non-null   object
 7   nAbsDomiciliosApto                                   5641 non-null   object
 8   nAbsImoveisAlugados                                  5641 non-null   object
 9   nAbs1PessoasDomicilio                                5641 non-null   object
 10  nAbs1PessoasDomicilio                                5641 non-null   object
 11  nAbs2PessoasDomicilio                                5641 non-null   object
 12  nAbs3PessoasDomicilio                                5641 non-null   object
 13  nAbs4PessoasDomicilio                                5641 non-null   object
 14  nAbs5ouMaisPessoasDomicilio                          5641 non-null   object
 15  nAbsHabitantes                                       5641 non-null   int64
 16  nAbsMoradoresCasa                                    5641 non-null   int64
 17  nAbsMoradoresApto                                    5641 non-null   int64
 18  nAbsMoradoresImoveisAlugados                         5641 non-null   int64
 19  nAbsConjuges                                         5641 non-null   int64
 20  nAbsHomensResidentes                                 5641 non-null   int64
 21  nAbsMulheresResidentes                               5641 non-null   int64
 22  TotalRendNomMensalDomParticulares                    5641 non-null   int64
 23  TotalRendimentoNomMensalDomParticularesPermanentes   5641 non-null   int64
 24  TotalRendimentoNomMensalDomParitulcaresImprovisados  5641 non-null   int64
 25  nAbsPessoasClasseE                                   5641 non-null   int64
 26  nAbsPessoasClasseD                                   5641 non-null   int64
 27  nAbsPessoasClasseC                                   5641 non-null   int64
 28  nAbsPessoasClasseB                                   5641 non-null   int64
 29  nAbsPessoasClasseA                                   5641 non-null   int64
dtypes: float64(4), int64(17), object(9)
memory usage: 1.3+ MB

In [70]:
dfTotalAmazonas.to_csv('Amazonas.csv', sep= ';', encoding = 'utf-8')

Conferir num. abs. de 5 ou mais pessoas por domicilio